import styles from "./Delivery.module.css";

const Delivery = ({theme, setTheme}) => {
  return (
    <div className={theme ? styles.main : styles.mainDark}>
      <div className={styles.block}>
        <h1>Условия доставки</h1>
        <br />
        <p>
          Курьерская доставка службой Dostavista Москва (МКАД) — 650₽, доставка
          с примеркой (осуществляется с 12.00 до 18.00 каждый день) 850₽ за
          пределы МКАД рассчитывается индивидуально. Согласуем интервал доставки
          в течение дня после оформления заказа, доставим за 1-2 дня или в
          нужную дату, при условии наличия вещей на складе.
          <br />
          <br />
          При условии отшива вещей в заказе, срок отправления увеличивается на 5
          рабочих дней.
          <br />
          <br />
          Доставка работает каждый день с 12:00 до 20:00.
          <br />
          <br />
          Количество вещей на примерку согласовывается с работником магазина.
          <br />
          <br />
          Примерка — 15 минут. Если ничего не подойдёт, оплачивается только
          доставка.
          <br />
          <br />
          В период проведения распродажи сроки доставки могут быть увеличены на
          3-4 рабочих дня
          <br />
          <br />
          Доставка по России осуществляется курьерской службой СДЭК по 100%
          предоплате.
          <br />
          <br />
          График отправлений: среда, пятница.
          <br />
          <br />
          Трек номер отправляется в день сборки и сразу после оформления посылки
          в магазине.
          <br />
          <br />
          Срок сборки и оформления посылки зависит от наличия вещей на складе.
          <br />
          <br />
          При условии отшива вещей в заказе, срок отправления увеличивается на 5
          рабочих дней.
          <br />
          <br />
          В период проведения распродажи сроки доставки могут быть увеличены на
          3-4 рабочих дня
          <br />
          <br />
          Самовывоз из фирменных магазинов бесплатно, по предоплате
          <br />
          <br />
          Срок хранения неоплаченных заказов на самовывоз 24 часа после
          подтверждения заказа
          <br />
          <br />
          Комплектуем заказы до 18:00 в день оформления.
          <br />
          <br />
          Срок подготовки может увеличиться, если в день заказа товар закончится
          в магазине.
          <br />
          <br />
          Дополнительно сообщим об увеличении срока и позвоним, когда заказ
          будет готов к выдаче.
          <br />
          <br />
          Срок хранения оплаченного заказа неограничен.
        </p>
      </div>
      <div className={styles.block}>
        <h1>Возврат</h1>
        <br />
        <p>
          Сообщите нам на mansur72095@gmail.com или по номеру 8 (928) 888-64-89,
          если нужно обменять или вернуть товар по заказу, оформленному в
          Интернет-магазине.
          <br /> <br />
          Условия: Отправим новый товар или вернём деньги, если: — товаром не
          пользовались; — его купили на официальном сайте либо в нашем магазине;
          — товар приобрели в течение 14 дней не считая дня покупки;
          <br /> <br />
          Способы: Можно вернуть заказ в фирменный магазин по адресу г.Грозный
          ул. Трошева 7
          <br /> <br />
          Для оформления нужен электронный/бумажный чек.
          <br /> <br />
          Возврат онлайн заказов осуществляется за ваш счет, в качестве службы
          доставки можете использовать любой удобный для вас способ (СДЭК, Почта
          России и тд). Доставка вашего возврата/обмена осуществляется строго до
          двери нашего магазина по адресу: г. Москва, ул. Большая
          Новодмитровская, 36с2. Информацию для отслеживания нужно сообщить на
          почту либо по номеру телефона.
          <br /> <br />
          Возврат денежных средств Деньги вернутся на карту, с которой
          производилась оплата, в течение 5 дней после получения и проверки
          товара. О смене реквизитов нужно сообщить дополнительно. Для
          оформления нужен электронный чек.
        </p>
      </div>
      <div className={styles.block}>
        <h1>ВОЗВРАТ И ОБМЕН ИНДИВИДУАЛЬНЫХ ИЗДЕЛИЙ</h1>
        <br />
        <p>
          1. Изделия с индивидуальными свойства требуют полную предоплату.
          <br /> <br />
          2. Оттенки итогового изделия могут не полностью соответствовать
          оттенкам, отображаемым на экране вашего устройства. Это особенность
          каждого отдельного смартфона в зависимости от настроек экрана.
          <br /> <br />
          3. После оформления заказа с вами связывается наш консультант и
          пришлет на электронную почту или мессенджер изображение с точным
          итоговым цветом.
          <br /> <br />
          4. Возврат изделия, выполненного по индивидуальному заказу,
          невозможен.
          <br /> <br />
          Индивидуальный заказ — приобретение товара, который выполнен по
          размерам, дизайну покупателя, имеет индивидуальное сочетание
          материалов, модифицирован по желанию клиента, со специальными
          надписями, нанесенными по желанию клиента.
          <br /> <br />
          Покупатель не вправе отказаться от товара надлежащего качества,
          имеющего индивидуально-определенные свойства, если указанный товар
          может быть использован исключительно приобретающим его потребителем.
          <br /> <br />
          Основание — п. 21 «Правил продажи товаров дистанционным способом»,
          утв. Постановлением Правительства РФ от 27.09.2007г. № 612, п. 4 ст.
          26.1 Закона РФ от 07.02.1992г. № 2300-1 «О защите прав потребителей».
        </p>
      </div>
    </div>
  );
};

export default Delivery;
